# str関数はオブジェクトの情報を含めてコンソール画面に出力します。
# この関数は、オブジェクトの型やサイズ、属性、要素の型などを表示します。
# また、オブジェクトの中身を表示することもできます。
# R言語では、データ型を「ベクトル型」「クラス型」「関数型」の3つで表現します。
# この3つのデータ型は、R言語の基本的なデータ型です。
# 基本型のデータ型は、ベクトル型とクラス型です。
# ベクトル型は、数値型、文字型、論理型、複素数型の4つのデータ型を含みます。

str(1)
str("A")
str("あいうえお")
str(TRUE)
str(1L)
str(1.0)
str(1 + 0i)
str(1:10)
str(letters)
str(LETTERS)
str(1:10 / 10)
str(1:10 / 10.0)
str(1:10 / 10.0 + 0i)

# ========== ========== ========== ========== ==========
# 実行結果
# ========== ========== ========== ========== ==========

# num 1
# chr "A"
# chr "あいうえお"
# logi TRUE
# int 1
# num 1
# cplx 1+0i
# int [1:10] 1 2 3 4 5 6 7 8 9 10
# chr [1:26] "a" "b" "c" "d" "e" "f" "g" "h" "i" "j" "k" "l" "m" "n" "o" "p" ...
# chr [1:26] "A" "B" "C" "D" "E" "F" "G" "H" "I" "J" "K" "L" "M" "N" "O" "P" ...
# num [1:10] 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1
# num [1:10] 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1
# cplx [1:10] 0.1+0i 0.2+0i 0.3+0i ...

# ☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
# ★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆
# ☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
# ★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆
# ☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★

# データ型はclass関数で確認できます。
# class関数は、オブジェクトのクラスを返します。

print(class(1))
print(class("A"))
print(class("あいうえお"))
print(class(TRUE))
print(class(1L))
print(class(1.0))
print(class(1 + 0i))
print(class(1:10))
print(class(letters))
print(class(LETTERS))
print(class(1:10 / 10))
print(class(1:10 / 10.0))
print(class(1:10 / 10.0 + 0i))

# ========== ========== ========== ========== ==========
# 実行結果
# ========== ========== ========== ========== ==========

# [1] "numeric"
# [1] "character"
# [1] "character"
# [1] "logical"
# [1] "integer"
# [1] "numeric"
# [1] "complex"
# [1] "integer"
# [1] "character"
# [1] "character"
# [1] "numeric"
# [1] "numeric"
# [1] "complex"
